Revit 2027 API
BuiltInFailures.StairRampFailures.WinderRunWidthLessThanWalkLineOffsetFailure Property
 The value for Run Width is less than two times of value of the inside walkline offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderRunWidthLessThanWalkLineOffsetFailure { get; }
Public Shared ReadOnly Property WinderRunWidthLessThanWalkLineOffsetFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderRunWidthLessThanWalkLineOffsetFailure {
	FailureDefinitionId^ get ();
}
static member WinderRunWidthLessThanWalkLineOffsetFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace